<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Box-Office-Winners:-An-In-Depth-Analysis-of-What-It-Takes-to-Make-A-Successful-Movie" data-toc-modified-id="Box-Office-Winners:-An-In-Depth-Analysis-of-What-It-Takes-to-Make-A-Successful-Movie-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Box Office Winners: An In-Depth Analysis of What It Takes to Make A Successful Movie</a></span><ul class="toc-item"><li><span><a href="#Overview" data-toc-modified-id="Overview-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Overview</a></span></li><li><span><a href="#Business-Problem" data-toc-modified-id="Business-Problem-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Business Problem</a></span></li><li><span><a href="#Data-Understanding" data-toc-modified-id="Data-Understanding-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Data Understanding</a></span><ul class="toc-item"><li><span><a href="#Box-Office-Mojo-Data" data-toc-modified-id="Box-Office-Mojo-Data-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Box Office Mojo Data</a></span></li><li><span><a href="#The-Numbers:-Movie-Budgets" data-toc-modified-id="The-Numbers:-Movie-Budgets-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>The Numbers: Movie Budgets</a></span></li><li><span><a href="#IMDB-Data" data-toc-modified-id="IMDB-Data-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>IMDB Data</a></span></li></ul></li><li><span><a href="#Data-Preparation" data-toc-modified-id="Data-Preparation-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Data Preparation</a></span><ul class="toc-item"><li><span><a href="#Studios" data-toc-modified-id="Studios-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>Studios</a></span></li><li><span><a href="#The-Numbers:-Movie-Budgets" data-toc-modified-id="The-Numbers:-Movie-Budgets-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span>The Numbers: Movie Budgets</a></span></li><li><span><a href="#IMDB" data-toc-modified-id="IMDB-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>IMDB</a></span></li></ul></li><li><span><a href="#Data-Analysis" data-toc-modified-id="Data-Analysis-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Data Analysis</a></span><ul class="toc-item"><li><span><a href="#Most-Produced-Movies-by-Genre" data-toc-modified-id="Most-Produced-Movies-by-Genre-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>Most Produced Movies by Genre</a></span></li><li><span><a href="#Most-Profitable-Genres" data-toc-modified-id="Most-Profitable-Genres-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Most Profitable Genres</a></span></li><li><span><a href="#Top-Studios" data-toc-modified-id="Top-Studios-1.5.3"><span class="toc-item-num">1.5.3&nbsp;&nbsp;</span>Top Studios</a></span></li><li><span><a href="#Highest-Grossing-Movies" data-toc-modified-id="Highest-Grossing-Movies-1.5.4"><span class="toc-item-num">1.5.4&nbsp;&nbsp;</span>Highest Grossing Movies</a></span></li><li><span><a href="#Release-Date" data-toc-modified-id="Release-Date-1.5.5"><span class="toc-item-num">1.5.5&nbsp;&nbsp;</span>Release Date</a></span></li></ul></li><li><span><a href="#Evaluation" data-toc-modified-id="Evaluation-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Evaluation</a></span></li><li><span><a href="#Conclusions" data-toc-modified-id="Conclusions-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Conclusions</a></span></li></ul></li></ul></div>

![example](images/director_shot.jpeg)

# Box Office Winners: An In-Depth Analysis of What It Takes to Make A Successful Movie 

**Prepared for:** Microsoft
<br>**Authors:** Alex Casey
***

## Overview

A one-paragraph overview of the project, including the business problem, data, methods, results and recommendations.

## Business Problem

Microsoft (<i>the "Client"</i>) is investigating creating a new movie studio, but they don’t know anything about creating movies. In this report, we will explore what types of films are currently successful the box office. 

It's important to note upfront that while there's a lot of money to be made in the film industry, the economics of movie-making are far from simple.
There's no sure path for a film to turn a profit since factors like brand awareness, P&A budgets, and the desires of a fickle public come into play.
Theater attendance in the U.S. has been challenging over recent years, making it even more important to earn money in foreign theaters.
Ever since Star Wars, merchandising has played a major role in revenue for films that appeal to children.
Television rights, video-on-demand, and streaming services are increasingly important sources of income for movie studios.

In this analysis, I will attempt to resolve three key questions for the Client in an effort to make a transition into movie-making successful:
  1. What types of movies have been produced the most in the past 20 years and what genres have been most successful?
  2. Which studios have been the most successful and do any warrant a potential partnership?
  3. Is release date a determinant of box-office success?

***
Questions to consider:
* What are the business's pain points related to this project?
* How did you pick the data analysis question(s) that you did?
* Why are these questions important from a business perspective?
***

## Data Understanding

The data for this project comes from several movie datasets including, Box Office Mojo (BOM), IMDB, Rotten Tomatoes, The MovieDB, and The Numbers. After investigating all sources, I settled on using datasets from BOM, IMDB, and The Numbers to form my hypotheses and develop three key recommendations. 
***
Questions to consider:
* Where did the data come from, and how do they relate to the data analysis questions?
* What do the data represent? Who is in the sample and what variables are included?
* What is the target variable?
* What are the properties of the variables you intend to use?
***

In [8]:
# Import standard packages
#using blob will get us the full file path
import pandas
import os, glob
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline
folder = "/Users/alexcasey92/Documents/Flatiron/phase_1/Project/dsc-project-template/data/zippedData/"
os.listdir(folder)

['imdb.title.crew.csv.gz',
 '.DS_Store',
 'tmdb.movies.csv.gz',
 'imdb.title.akas.csv.gz',
 'imdb.title.ratings.csv.gz',
 'imdb.name.basics.csv.gz',
 'rt.reviews.tsv.gz',
 'imdb.title.basics.csv.gz',
 'rt.movie_info.tsv.gz',
 'tn.movie_budgets.csv.gz',
 'bom.movie_gross.csv.gz',
 'imdb.title.principals.csv.gz']

In [9]:
f"{folder}*.csv*"

'/Users/alexcasey92/Documents/Flatiron/phase_1/Project/dsc-project-template/data/zippedData/*.csv*'

In [10]:
files = glob.glob(f"{folder}*.csv*")

In [11]:
files[0].replace('.csv.gz','').split('/')[-1].replace('.','_')

'imdb_title_crew'

In [12]:
data = {}
dashes='---'*25

for file in files:
    key = file.split('/')[-1].replace('.csv.gz','').replace('.','_')
    print(dashes)
                              
    print(f"Preview_of {key}")
    data[key] = pd.read_csv(file)
    display(data[key].head(10))
    display(data[key].info())
    
    print()

---------------------------------------------------------------------------
Preview_of imdb_title_crew

,tconst,directors,writers
0,tt0285252,nm0899854,nm0899854
1,tt0438973,NaN,"nm0175726,nm1802864"
2,tt0462036,nm1940585,nm1940585
3,tt0835418,nm0151540,"nm0310087,nm0841532"
4,tt0878654,"nm0089502,nm2291498,nm2292011",nm0284943
5,tt0879859,nm2416460,NaN
6,tt0996958,nm2286991,"nm2286991,nm2651190"
7,tt0999913,nm0527109,"nm0527109,nm0329051,nm0001603,nm0930684"
8,tt10003792,nm10539228,nm10539228
9,tt10005130,nm10540239,"nm5482263,nm10540239"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

None

---------------------------------------------------------------------------
Preview_of tmdb_movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
5,5,"[12, 14, 10751]",32657,en,Percy Jackson & the Olympians: The Lightning T...,26.691,2010-02-11,Percy Jackson & the Olympians: The Lightning T...,6.1,4229
6,6,"[28, 12, 14, 878]",19995,en,Avatar,26.526,2009-12-18,Avatar,7.4,18676
7,7,"[16, 10751, 35]",10193,en,Toy Story 3,24.445,2010-06-17,Toy Story 3,7.7,8340
8,8,"[16, 10751, 35]",20352,en,Despicable Me,23.673,2010-07-09,Despicable Me,7.2,10057
9,9,"[16, 28, 35, 10751, 878]",38055,en,Megamind,22.855,2010-11-04,Megamind,6.8,3635

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

None

---------------------------------------------------------------------------
Preview_of imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
5,tt0369610,15,Jurassic World,GR,NaN,imdbDisplay,NaN,0.0
6,tt0369610,16,Jurassic World,IT,NaN,imdbDisplay,NaN,0.0
7,tt0369610,17,Jurski svijet,HR,NaN,imdbDisplay,NaN,0.0
8,tt0369610,18,Olam ha'Yura,IL,he,imdbDisplay,NaN,0.0
9,tt0369610,19,Jurassic World: Mundo Jurásico,MX,NaN,imdbDisplay,NaN,0.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

None

---------------------------------------------------------------------------
Preview_of imdb_title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
5   tt1069246            6.2       326
6   tt1094666            7.0      1613
7   tt1130982            6.4       571
8   tt1156528            7.2       265
9   tt1161457            4.2       148

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

None

---------------------------------------------------------------------------
Preview_of imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
5,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous","tt2590280,tt0352080,tt0216559,tt2057445"
6,nm0063198,Bayou,NaN,NaN,actor,"tt6579724,tt0093116"
7,nm0063432,Stevie Be-Zet,NaN,NaN,"composer,soundtrack","tt3106212,tt0478239,tt0264917,tt1626606"
8,nm0063618,Jeff Beal,1963.0,NaN,"composer,music_department,soundtrack","tt0183659,tt2545118,tt0384766,tt1856010"
9,nm0063750,Lindsay Beamish,NaN,NaN,"actress,miscellaneous","tt0404826,tt0111756,tt0367027,tt1492842"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

None

---------------------------------------------------------------------------
Preview_of imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
8,tt0139613,O Silêncio,O Silêncio,2012,NaN,"Documentary,History"
9,tt0144449,Nema aviona za Zagreb,Nema aviona za Zagreb,2012,82.0,Biography

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

None

---------------------------------------------------------------------------
Preview_of tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

None

---------------------------------------------------------------------------
Preview_of bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
5,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010
6,Iron Man 2,Par.,312400000.0,311500000,2010
7,Tangled,BV,200800000.0,391000000,2010
8,Despicable Me,Uni.,251500000.0,291600000,2010
9,How to Train Your Dragon,P/DW,217600000.0,277300000,2010

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

None

---------------------------------------------------------------------------
Preview_of imdb_title_principals

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,2,nm0398271,director,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
5,tt0323808,2,nm2694680,actor,NaN,"[""Steve Thomson""]"
6,tt0323808,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]"
7,tt0323808,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]"
8,tt0323808,5,nm0362736,director,NaN,NaN
9,tt0323808,6,nm0811056,producer,producer,NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   tconst      1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   nconst      1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

None

In [13]:
data.keys()

dict_keys(['imdb_title_crew', 'tmdb_movies', 'imdb_title_akas', 'imdb_title_ratings', 'imdb_name_basics', 'imdb_title_basics', 'tn_movie_budgets', 'bom_movie_gross', 'imdb_title_principals'])

### Box Office Mojo Data

In [14]:
studios = data['bom_movie_gross']

In [15]:
studios.info()
studios.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [16]:
studios.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [17]:
studios['domestic_gross'].describe()

count    3.359000e+03
mean     2.874585e+07
std      6.698250e+07
min      1.000000e+02
25%      1.200000e+05
50%      1.400000e+06
75%      2.790000e+07
max      9.367000e+08
Name: domestic_gross, dtype: float64

In [18]:
studios['foreign_gross'] = studios['foreign_gross'].apply(str).str.replace(",", "").astype(float)

In [19]:
studios['foreign_gross'] = pd.to_numeric(studios['foreign_gross'])

In [20]:
#why use the median to fill in?
studios['foreign_gross'] = studios['foreign_gross'].fillna(studios['foreign_gross'].median())
studios['domestic_gross'] = studios['domestic_gross'].fillna(studios['domestic_gross'].median())

In [21]:
studios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3387 non-null   float64
 3   foreign_gross   3387 non-null   float64
 4   year            3387 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 132.4+ KB

In [22]:
#Think about dropping foreign gross instead of filling in 
#Drop the foreign gross column. Too many Null values
#bom_movie_no_nulls = bom_movie.drop(columns='foreign_gross', axis =1, inplace=True)

In [23]:
#drop na values
studios = studios.dropna()

In [24]:
studios.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3382 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3382 non-null   float64
 3   foreign_gross   3382 non-null   float64
 4   year            3382 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 158.5+ KB

In [25]:
#add 'total gross column'
studios['total_gross'] = studios['foreign_gross'] + studios['domestic_gross']

<ipython-input-25-129956fb1e3b>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  studios['total_gross'] = studios['foreign_gross'] + studios['domestic_gross']

In [26]:
# do i need to save this to a new frame?
#studios

### The Numbers: Movie Budgets

In [27]:
data.keys()

dict_keys(['imdb_title_crew', 'tmdb_movies', 'imdb_title_akas', 'imdb_title_ratings', 'imdb_name_basics', 'imdb_title_basics', 'tn_movie_budgets', 'bom_movie_gross', 'imdb_title_principals'])

In [28]:
budgets = data['tn_movie_budgets']

In [29]:
budgets.info()
budgets.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

### IMDB Data

In [30]:
imdb1 = data['imdb_title_basics']
imdb1.info()
imdb1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [31]:
imdb2 = data['imdb_title_ratings']
imdb2.info()
imdb2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

## Data Preparation

Describe and justify the process for preparing the data for analysis.

***
Questions to consider:
* Were there variables you dropped or created?
* How did you address missing values or outliers?
* Why are these choices appropriate given the data and the business problem?
***

### Studios

In [38]:
studios.info()
studios.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3382 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3382 non-null   float64
 3   foreign_gross   3382 non-null   float64
 4   year            3382 non-null   int64
 5   total_gross     3382 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 185.0+ KB

,title,studio,domestic_gross,foreign_gross,year,total_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,9.603000e+08
3,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08

In [33]:
studios.year.unique()

array([2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018])

In [34]:
display(studios.isna().sum())

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
total_gross       0
dtype: int64

In [39]:
duplicates = studios[studios.duplicated(subset='title')]
print(len(duplicates))
duplicates.tail()

1

          title studio  domestic_gross  foreign_gross  year  total_gross
3045  Bluebeard  WGUSA         43100.0     18700000.0  2017   18743100.0

In [36]:
#There are no duplicates
duplicates = studios[studios.duplicated()]

In [37]:
#Many figures in foreign gross column are obviously wrong
studios.sort_values("domestic_gross",  ascending=False)

,title,studio,domestic_gross,foreign_gross,year,total_gross
1872,Star Wars: The Force Awakens,BV,936700000.0,1131.6,2015,9.367011e+08
3080,Black Panther,BV,700100000.0,646900000.0,2018,1.347000e+09
3079,Avengers: Infinity War,BV,678800000.0,1369.5,2018,6.788014e+08
1873,Jurassic World,Uni.,652300000.0,1019.4,2015,6.523010e+08
727,Marvel's The Avengers,BV,623400000.0,895500000.0,2012,1.518900e+09
...,...,...,...,...,...,...
1018,Apartment 143,Magn.,400.0,426000.0,2012,4.264000e+05
2756,News From Planet Mars,KL,300.0,18700000.0,2016,1.870030e+07
2757,Satanic,Magn.,300.0,18700000.0,2016,1.870030e+07
2321,The Chambermaid,FM,300.0,18700000.0,2015,1.870030e+07
1476,Storage 24,Magn.,100.0,18700000.0,2013,1.870010e+07

### The Numbers: Movie Budgets

In [40]:
budgets.info()
budgets.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [41]:
#change movie key to 'primary_title' to match other dataset for easier merge
budgets = budgets.rename(columns={"movie": "primary_title"})

In [42]:
budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   primary_title      5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [43]:
#datetime format
budgets['release_date'] = pd.to_datetime(budgets['release_date'])

In [44]:
budgets['release_date']

0      2009-12-18
1      2011-05-20
2      2019-06-07
3      2015-05-01
4      2017-12-15
          ...
5777   2018-12-31
5778   1999-04-02
5779   2005-07-13
5780   2015-09-29
5781   2005-08-05
Name: release_date, Length: 5782, dtype: datetime64[ns]

In [45]:
#probably dont need this because release_date is formatted correctly for graphing
budgets['release_year'] = budgets['release_date'].dt.year
budgets['release_month'] = budgets['release_date'].dt.month
#df_tn['year'] = pd.to_numeric(df_tn['year']).astype(int)
budgets

,id,release_date,primary_title,production_budget,domestic_gross,worldwide_gross,release_year,release_month
0,1,2009-12-18,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,12
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,5
2,3,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,6
3,4,2015-05-01,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,5
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017,12
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"$7,000",$0,$0,2018,12
5778,79,1999-04-02,Following,"$6,000","$48,482","$240,495",1999,4
5779,80,2005-07-13,Return to the Land of Wonders,"$5,000","$1,338","$1,338",2005,7
5780,81,2015-09-29,A Plague So Pleasant,"$1,400",$0,$0,2015,9
5781,82,2005-08-05,My Date With Drew,"$1,100","$181,041","$181,041",2005,8

In [46]:
#check for duplicates
duplicates2 = budgets[budgets.duplicated(subset='primary_title')]
print(len(duplicates))

1

In [47]:
budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   datetime64[ns]
 2   primary_title      5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
 6   release_year       5782 non-null   int64
 7   release_month      5782 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(4)
memory usage: 361.5+ KB

In [48]:
#remove $
budgets['production_budget'] = budgets['production_budget'].apply(str).str.replace('$', '')
budgets['production_budget'] = budgets['production_budget'].apply(str).str.replace(',', '').astype(int)

In [49]:
#remove $ and commas
budgets['domestic_gross'] = budgets['domestic_gross'].apply(str).str.replace('$', '')
budgets['domestic_gross'] = budgets['domestic_gross'].apply(str).str.replace(',', '').astype(int)

In [50]:
#remove $ and commas
budgets['worldwide_gross'] = budgets['worldwide_gross'].apply(str).str.replace('$', '')
budgets['worldwide_gross'] = budgets['worldwide_gross'].apply(str).str.replace(',', '').astype(int)

In [51]:
#convert year and month to integer
budgets['release_year'] = pd.to_numeric(budgets['release_year']).astype(int)
budgets['release_month'] = pd.to_numeric(budgets['release_month']).astype(int)

In [52]:
#matches it with range from bom.movie
budgets = budgets[budgets['release_year'] >= 2010]

In [53]:
dups = budgets[budgets.duplicated()]
#df_imdb_edit = df_imdb_edit.drop_duplicates(subset=None, keep='first')
display(dups)

Empty DataFrame
Columns: [id, release_date, primary_title, production_budget, domestic_gross, worldwide_gross, release_year, release_month]
Index: []

### IMDB

In [54]:
#join imdb tables
imdb = pd.merge(imdb1, imdb2, how='inner', on="tconst")
imdb.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

In [55]:
duplicates3 = imdb[imdb.duplicated(subset='primary_title')]
print(len(duplicates))

1

In [56]:
#no duplicates
duplicate_imdb = imdb[imdb.duplicated()]

In [57]:
#check for null values
display(imdb.isna().sum())

tconst                0
primary_title         0
original_title        0
start_year            0
runtime_minutes    7620
genres              804
averagerating         0
numvotes              0
dtype: int64

In [58]:
#Drop NA
imdb = imdb.dropna()

In [59]:
#Splitting out genres so that I can evaluate them independently
imdb['genres'] = imdb['genres'].str.split(',')
genres = imdb.explode('genres')

In [60]:
genres

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,Action,7.0,77
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,Crime,7.0,77
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,Drama,7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,Biography,7.2,43
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,Drama,7.2,43
...,...,...,...,...,...,...,...,...
73850,tt9913056,Swarm Season,Swarm Season,2019,86.0,Documentary,6.2,5
73851,tt9913084,Diabolik sono io,Diabolik sono io,2019,75.0,Documentary,6.2,6
73852,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,98.0,Drama,8.7,136
73852,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,98.0,Family,8.7,136
73855,tt9916160,Drømmeland,Drømmeland,2019,72.0,Documentary,6.5,11

In [61]:
#looks like start year and runtime minutes
imdb.describe()

         start_year  runtime_minutes  averagerating      numvotes
count  65720.000000     65720.000000   65720.000000  6.572000e+04
mean    2014.258065        94.732273       6.320902  3.954674e+03
std        2.600143       209.377017       1.458878  3.208823e+04
min     2010.000000         3.000000       1.000000  5.000000e+00
25%     2012.000000        81.000000       5.500000  1.600000e+01
50%     2014.000000        91.000000       6.500000  6.200000e+01
75%     2016.000000       104.000000       7.300000  3.520000e+02
max     2019.000000     51420.000000      10.000000  1.841066e+06

In [62]:
#looking for outliers
#this movie actually exists
imdb = imdb[(imdb['start_year'] == 2115) | (imdb['runtime_minutes'] == 51420)]
imdb.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
70280,tt8273150,Logistics,Logistics,2012,51420.0,[Documentary],5.0,17

In [ ]:
#think about creating average rating by genre?

In [63]:
ratings = imdb.drop(columns=['tconst', 'runtime_minutes', 'original_title'])

ratings.describe()

       start_year  averagerating  numvotes
count         1.0            1.0       1.0
mean       2012.0            5.0      17.0
std           NaN            NaN       NaN
min        2012.0            5.0      17.0
25%        2012.0            5.0      17.0
50%        2012.0            5.0      17.0
75%        2012.0            5.0      17.0
max        2012.0            5.0      17.0

Data very dispersed

In [64]:
Q1 = ratings['numvotes'].quantile(0.25)
Q3 = ratings['numvotes'].quantile(0.75)
IQR = Q3 - Q1
print(Q1, Q3, IQR)

17.0 17.0 0.0

In [65]:
ratings = ratings[ratings['numvotes'] >= Q1]
ratings = ratings[ratings['numvotes'] <= Q3]
ratings.describe()

       start_year  averagerating  numvotes
count         1.0            1.0       1.0
mean       2012.0            5.0      17.0
std           NaN            NaN       NaN
min        2012.0            5.0      17.0
25%        2012.0            5.0      17.0
50%        2012.0            5.0      17.0
75%        2012.0            5.0      17.0
max        2012.0            5.0      17.0

## Data Analysis
Describe and justify the process for analyzing or modeling the data.

***
Questions to consider:
* How did you analyze or model the data?
* How did you iterate on your initial approach to make it better?
* Why are these choices appropriate given the data and the business problem?
***

### Most Produced Movies by Genre

In [ ]:
genres_count = genres['genres'].value_counts()
genres_count = genres_count[:10,]

plt.figure(figsize=(15, 7))
sns.set_context('notebook')
sns.set_style("white")
sns.barplot(
    x=genres_count.index,
    y=genres_count.values,
    palette="cubehelix"
).set(
    ylabel="Number of Movies",
    xlabel="Top 10 Genres", 
    title="Top 10 Most Produced Movie Genres"
    
);
#remove top and right axes spines
sns.despine()

### Most Profitable Genres

In [ ]:
#https://github.com/learn-co-curriculum/dsc-data-serialization-lab/tree/solution

In [ ]:
genres.head()

In [ ]:
budgets.head()

In [ ]:
#Join budgets and genres on shared 'primary_title' column
genre_num = pd.merge(genres, budgets, on='primary_title', how='right')
genre_num.info()
genre_num.head()

In [ ]:
#Calculate gross profit and create new column for it
genre_num['gross_profit'] = genre_num['worldwide_gross'] - genre_num['production_budget']
genre_num.head()

In [ ]:
#remove
genre_num['worldwide_gross'].replace(0, 1)
genre_num.info()

In [ ]:
#https://pandas.pydata.org/docs/reference/api/pandas.Series.groupby.html#pandas.Series.groupby
#groupby
#investigate

In [ ]:
genre_group = genre_num.groupby(genre_num.genres)
genre_group.head()

In [ ]:
mean_profit = genre_group['gross_profit'].mean()
#mean_profit.sort_values(ascending=False, inplace=True)
#mean_profit
mean_profit

In [ ]:
import matplotlib as mpl

In [ ]:
genre_num

In [ ]:
genre_num.groupby('genres').mean()['gross_profit'].iloc[:10,].sort_values(ascending=False)

In [ ]:
order= genre_num.groupby('genres').mean()['gross_profit'].iloc[:10,].sort_values(ascending=False).index
price_fmt = mpl.ticker.StrMethodFormatter('${x:,.0f}')

fig, ax = plt.subplots(figsize=(10,6),)
ax = sns.barplot(data=genre_num, x='genres',y='gross_profit',order=order)
ax.yaxis.set_major_formatter(price_fmt)

In [ ]:
def millions(x, pos):
    """The two args are the value and tick position."""
    return '${:1.1f}M'.format(x*1e-6)

fig, ax = plt.subplots()
# Use automatic FuncFormatter creation
ax.yaxis.set_major_formatter(millions)
ax.bar(['Bill', 'Fred', 'Mary', 'Sue'], money)
plt.show()

In [ ]:
plt.figure(figsize=(15, 7))
sns.set_context('notebook')
sns.set_style("white")
sns.barplot(
    x=mean_profit[0],
    y=mean_profit.values,
    orient="v",
    data=mean_profit[:10,],
    palette="cubehelix" # set a sequential colormap #flare
).set(
    ylabel="Mean Gross Profit (expressed in 100M",
    xlabel="Top 10 Genres", 
    title="Top 10 Genres - Highest Average Gross Profit"
    
);
#remove top and right axes spines
sns.despine()

In [ ]:
#look for correlation between profit and budget?

In [ ]:
plt.figure(figsize=(15, 7))
sns.set_context('notebook')
sns.set_style("white")
sns.barplot(
    x=mean_profit.index,
    y=mean_profit.values, 
    orient="v",
    data=mean_profit[:10,], # telling it to plot using the axes already created  
    palette="cubehelix" # set a sequential colormap #flare
).set(
    ylabel="Mean Gross Profit (expressed in 100M",
    xlabel="Top 10 Genres", 
    title="Top 10 Genres - Highest Average Gross Profit"
    
);

### Top Studios

In [ ]:
studio_count = studios['studio'].value_counts()
studio_count = studio_count[:10]

In [ ]:
studio_count

In [ ]:

plt.figure(figsize=(15, 7))
sns.set_context('notebook')
sns.set_style("white")
sns.barplot(
    x=studio_count.index,
    y=studio_count.values,
    orient="v",
    data=studio_count.index,
    palette="cubehelix"
).set(
    xlabel="Studio",
    ylabel="Total Movies Produced",
    title="Top 10 Studios by Number of Movies Produced"
    order
    #reorder
    #set x tick to studio name
);
plt.show()

In [ ]:
top_stud = studios.groupby(['studio']).sum()
top_stud

In [ ]:
top_stud.index

In [ ]:
#sorted_gross_studio = bom_movie_neatened.domestic_gross.sort_values(ascending = False)
order2= studios.groupby('studios',['total_gross']).mean().iloc[:10,].sort_values(ascending=False).index

In [ ]:

fig, ax = plt.subplots(figsize=(10,6),)

sns.barplot(
    x=top_stud.index, 
    y='total_gross', 
    data=top_stud, # telling it to plot using the axes already created  
    palette="cubehelix" # set a sequential colormap #flare
).set(
    ylabel="Gross Sales",
    xlabel="Studios", 
    title="Highest Grossing Months"
);

### Highest Grossing Movies

In [ ]:
#most_rated = budgets.groupby('title').size().sort_values(ascending=False)[:25]
#most_rated = budgets.groupby(['primary_title','worldwide_gross'])
#most_rated.head()

budgets.groupby(['primary_title'])['worldwide_gross'].sum().sort_values(ascending=False).head(20)

In [6]:
#need to change because of df_5
plt.figure(figsize=(15, 7))
sns.lineplot(
    x=, 
    y=df_5["title"], 
    orient="h",
    data=df_5, # telling it to plot using the axes already created  
    palette="cubehelix" # set a sequential colormap #flare
).set(
    ylabel="Movies",
    xlabel="Gross Sales", 
    title="Highest Grossing Movies"
);

SyntaxError: invalid syntax (<ipython-input-6-6e6e4f918e85>, line 4)

### Release Date
When should we release a movie?

In [ ]:
month_average = budgets[['release_month', 'worldwide_gross']]
month_average_grouped = month_average.groupby('release_month', as_index=False).mean()
month_average_grouped

In [ ]:
plt.figure(figsize=(15, 7))
sns.lineplot(
    x='release_month', 
    y='worldwide_gross', 
    data=month_average_grouped, # telling it to plot using the axes already created  
    palette="cubehelix" # set a sequential colormap #flare
).set(
    ylabel="Gross Sales",
    xlabel="Months", 
    title="Highest Grossing Months"
);
#remove top and right axes spines
sns.despine()

In [ ]:
#correlation between gross revenue and release month?

## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?
***

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

***
Questions to consider:
* What would you recommend the business do as a result of this work?
* What are some reasons why your analysis might not fully solve the business problem?
* What else could you do in the future to improve this project?
***

Questions: 
"""
1. Most Profitable Genres
2. Should we partner with a studio?
3. When should we release a movie?
"""